old-classes/Intelligent_Data_Design/Assignments/lec13/lec13.tex
% Created 2023-02-21 Tue 17:28
% Intended LaTeX compiler: lualatex
\documentclass[11pt]{article}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage{physics}
\usepackage[margin=0.5in]{geometry}
\usepackage{tcolorbox} \usepackage{etoolbox}
\BeforeBeginEnvironment{minted}{\begin{tcolorbox}}%
\AfterEndEnvironment{minted}{\end{tcolorbox}}%
\BeforeBeginEnvironment{verbatim}{\begin{tcolorbox}}%
\AfterEndEnvironment{verbatim}{\end{tcolorbox}}%
\author{David Lewis}
\date{\today}
\title{lec12 activity}
\hypersetup{
 pdfauthor={David Lewis},
 pdftitle={lec12 activity},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.6)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section*{1.}
\label{sec:org281648e}
\subsection*{a, b.}
\label{sec:org70df6bc}
\begin{itemize}
\item Calculate relative distance (square root is not required)
\item save the top k results and take the mode
\end{itemize}
\begin{minted}[fontsize=\scriptsize]{python}
import pandas as pd
d = [[1,1,1,0],
    [2,1,3,0],
    [2,4,3,0],
    [4,1,4,0],
    [0,2,2,1],
    [1,4,1,1],
    [2,2,4,1],
    [2,4,5,1]]
d = pd.DataFrame(d, columns=("X", "Y", "Z", "C"))
def distance(xi, xj):
    return (xi-xj)**2
def L(xi, yi, zi, xj, yj, zj):
    dist = distance(xi,xj) + distance(yi,yj) + distance(zi,zj)
    return dist

d["distance1"] = d.apply(lambda row : L(1, 2, 1, row["X"], row["Y"], row["Z"]), axis=1)
d["distance2"] = d.apply(lambda row : L(3, 2, 4, row["X"], row["Y"], row["Z"]), axis=1)

k11 = int(d.sort_values(by=["distance1"]).head(1)["C"])
k12 = int(d.sort_values(by=["distance2"]).head(1)["C"])
k21 = int(d.sort_values(by=["distance1"]).head(3)["C"].mode())
k22 = int(d.sort_values(by=["distance2"]).head(3)["C"].mode())

l = [["ID", "K=1", "K=3"],
     [1, k11, k21],
     [2, k12, k22]]
return l
\end{minted}

\begin{center}
\begin{tabular}{rrr}
ID & K=1 & K=3\\
\hline
1 & 0 & 1\\
2 & 1 & 0\\
\end{tabular}
\end{center}
\subsection*{c.}
\label{sec:org99357aa}
The opposite result was determined based on the length of k. This was caused by
the top 3 results having more of the opposite class in the latter two results.
\section*{2.}
\label{sec:org259a571}
\subsection*{a.}
\label{sec:orgfb60618}
P(C=0) = P(C=1) = 1/2
\subsection*{b.}
\label{sec:org15cf63a}
\begin{center}
\begin{tabular}{l|lr}
 & C = 0 & C = 1\\
\hline
X=1 Y=1 Z=1 & 1/4 & 0\\
X=0 Y=1 Z=1 & 0 & 0\\
X=1 Y=0 Z=1 & 1/4 & 0\\
X=0 Y=0 Z=1 & 1/4 & 1/2\\
X=1 Y=0 Z=0 & 0 & 1/2\\
X=0 Y=0 Z=0 & 0 & 0\\
X=0 Y=1 Z=0 & 1/4 & 0\\
X=1 Y=1 Z=0 & 0 & 0\\
\end{tabular}
\end{center}
\subsection*{c.}
\label{sec:orge414cd4}
\begin{itemize}
\item \(P(C = 0|r) = 0\) r not in dataset so \(n_i(v)\) is zero, and zero in table
\item \(P(C = 1|r) = 0\) r not in dataset so \(n_i(v)\) is zero, and zero in table
\end{itemize}
\subsection*{d.}
\label{sec:orge2fcf1a}
\begin{center}
\begin{tabular}{l|ll}
 & C=0 & C=1\\
\hline
p(X=0\(\vert{}\) C) & 1/2 & 1/2\\
p(X=1\(\vert{}\) C) & 1/2 & 1/2\\
\end{tabular}
\end{center}


\begin{center}
\begin{tabular}{l|lr}
 & C=0 & C=1\\
\hline
p(Y=0\(\vert{}\) C) & 1/2 & 1\\
p(Y=1\(\vert{}\) C) & 1/2 & 0\\
\end{tabular}
\end{center}


\begin{center}
\begin{tabular}{l|ll}
 & C=0 & C=1\\
\hline
p(Z=0\(\vert{}\) C) & 1/4 & 1/2\\
p(Z=1\(\vert{}\) C) & 3/4 & 1/2\\
\end{tabular}
\end{center}
\subsection*{e.}
\label{sec:org6fdb19e}
\begin{itemize}
\item \(P(Y|C)\) requires a laplace corrrection because one of the probabilities in
the table is 0.
\end{itemize}
\subsection*{f.}
\label{sec:orge0096b2}

\begin{center}
\begin{tabular}{l|ll}
 & C=0 & C=1\\
\hline
p(X=0\(\vert{}\) C) & 1/2 & 1/2\\
p(X=1\(\vert{}\) C) & 1/2 & 1/2\\
\end{tabular}
\end{center}


\begin{center}
\begin{tabular}{l|ll}
 & C=0 & C=1\\
\hline
p(Y=0\(\vert{}\) C) & 1/2 & 5/6\\
p(Y=1\(\vert{}\) C) & 1/2 & 1/6\\
\end{tabular}
\end{center}


\begin{center}
\begin{tabular}{l|ll}
 & C=0 & C=1\\
\hline
p(Z=0\(\vert{}\) C) & 1/4 & 1/2\\
p(Z=1\(\vert{}\) C) & 3/4 & 1/2\\
\end{tabular}
\end{center}
\subsection*{g.}
\label{sec:orga63ad21}
\begin{center}
\begin{tabular}{l|ll}
 & C = 0 & C = 1\\
\hline
X=1 Y=1 Z=1 & 1/2 * 1/2 * 3/4 & 1/2 * 1/6 * 1/2\\
X=0 Y=1 Z=1 & 1/2 * 1/2 * 3/4 & 1/2 * 1/6 * 1/2\\
X=1 Y=0 Z=1 & 1/2 * 1/2 * 3/4 & 1/2 * 5/6 * 1/2\\
X=0 Y=0 Z=1 & 1/2 * 1/2 * 3/4 & 1/2 * 5/6 * 1/2\\
X=1 Y=0 Z=0 & 1/2 * 1/2 * 1/4 & 1/2 * 5/6 * 1/2\\
X=0 Y=0 Z=0 & 1/2 * 1/2 * 1/4 & 1/2 * 5/6 * 1/2\\
X=0 Y=1 Z=0 & 1/2 * 1/2 * 1/4 & 1/2 * 1/6 * 1/2\\
X=1 Y=1 Z=0 & 1/2 * 1/2 * 1/4 & 1/2 * 1/6 * 1/2\\
\end{tabular}
\end{center}
\subsection*{h.}
\label{sec:org9189aba}
\begin{itemize}
\item \(P(C = 0|r) = 1/2 \cdot 1/2 \cdot 1/4 * 1/2 = 1/32\)
\item \(P(C = 1|r) = 1/2 \cdot 5/6 \cdot 1/4 * 1/2 = 5/96\)
\end{itemize}
\end{document}
